maobon/epaper-esp32s3-zero/EpaperApiClient.cpp
#include "EpaperApiClient.h"

#include <ArduinoJson.h>
#include <HTTPClient.h>
#include <WiFiClientSecure.h>
#include <esp32-hal-psram.h>

#include "AppConfig.h"
#include "Secrets.h"
#include "PsramImageWriteStream.h"
#include "WifiManager.h"

namespace {

using SecureClient = WiFiClientSecure;

bool isSuccessfulHttpStatus(int statusCode) {
  return statusCode >= 200 && statusCode < 300;
}

void configureTls(SecureClient &client) {
  // 正式环境应改为 setCACert() 并配置可信 CA。
  client.setInsecure();
  client.setHandshakeTimeout(AppConfig::kTlsHandshakeTimeoutSeconds);
}

bool readBoundedResponse(HTTPClient &http, PsramImage &body, size_t limit) {
  const int expected = http.getSize();
  if (expected > 0 && static_cast<size_t>(expected) > limit) {
    Serial.println("HTTP 响应超过大小限制");
    return false;
  }
  const size_t capacity = expected > 0 ? static_cast<size_t>(expected)
                                      : min(limit, size_t(1024));
  if (!body.allocate(capacity)) {
    return false;
  }
  PsramImageWriteStream stream(body, limit);
  const int received = http.writeToStream(&stream);
  if (received <= 0 || stream.bytesWritten() != static_cast<size_t>(received) ||
      (expected > 0 && received != expected)) {
    Serial.println("HTTP 响应不完整、超限或内存不足");
    return false;
  }
  body.setSize(stream.bytesWritten());
  return true;
}

}  // namespace

bool EpaperApiClient::authenticate() {
  accessToken_.clear();
  return login();
}

bool EpaperApiClient::fetchImage(const char *imageName,
                                 PsramImage &destination) {
  if (accessToken_.isEmpty()) {
    Serial.println("尚未登录，无法请求图片");
    return false;
  }
  return downloadImage(imageName, destination);
}

bool EpaperApiClient::fetchNews(NewsList &destination) {
  if (accessToken_.isEmpty()) {
    Serial.println("尚未登录，无法请求新闻");
    return false;
  }
  return downloadNews(AppConfig::kNewsUrl, "news", AppConfig::kNewsItemCount,
                      false, destination);
}

bool EpaperApiClient::fetchChineseNews(NewsList &destination) {
  if (accessToken_.isEmpty()) {
    Serial.println("尚未登录，无法请求中文新闻");
    return false;
  }
  return downloadNews(AppConfig::kChineseNewsUrl, "news_audio",
                      AppConfig::kChineseNewsItemCount, true, destination);
}

bool EpaperApiClient::login() {
  if (!networkRequestsAllowed()) return false;
  SecureClient secureClient;
  HTTPClient http;
  configureTls(secureClient);

  if (!http.begin(secureClient, AppConfig::kLoginUrl)) {
    Serial.println("无法初始化登录 HTTPS 请求");
    return false;
  }

  http.setTimeout(AppConfig::kHttpTimeoutMs);
  http.setConnectTimeout(AppConfig::kHttpConnectTimeoutMs);
  http.addHeader("Content-Type", "application/json");

  JsonDocument requestJson;
  requestJson["username"] = Secrets::kApiUsername;
  requestJson["password"] = Secrets::kApiPassword;
  String requestBody;
  serializeJson(requestJson, requestBody);

  const int httpCode = http.POST(requestBody);
  Serial.print("登录接口 HTTP 状态码: ");
  Serial.println(httpCode);

  if (!isSuccessfulHttpStatus(httpCode)) {
    if (httpCode < 0) {
      Serial.print("登录请求失败: ");
      Serial.println(http.errorToString(httpCode));
    } else {
      Serial.println("登录接口返回非成功状态码");
    }
    http.end();
    return false;
  }

  PsramImage response;
  const bool responseOk =
      readBoundedResponse(http, response, AppConfig::kMaxLoginResponseBytes);
  http.end();
  if (!responseOk) {
    return false;
  }

  JsonDocument responseJson;
  const DeserializationError jsonError =
      deserializeJson(responseJson, static_cast<const uint8_t *>(response.data()),
                      response.size());
  if (jsonError) {
    Serial.print("JSON 解析失败: ");
    Serial.println(jsonError.c_str());
    return false;
  }

  if (!responseJson["access_token"].is<const char *>()) {
    Serial.println("服务端响应中没有有效的 access_token 字段");
    return false;
  }

  accessToken_ = responseJson["access_token"].as<String>();
  return !accessToken_.isEmpty();
}

bool EpaperApiClient::downloadImage(const char *imageName,
                                    PsramImage &destination) {
  if (!networkRequestsAllowed()) return false;
  if (!psramFound()) {
    Serial.println("未检测到 PSRAM，请检查开发板的 PSRAM 设置");
    return false;
  }

  SecureClient secureClient;
  HTTPClient http;
  configureTls(secureClient);

  const String imageUrl = String(AppConfig::kEpaperBaseUrl) + imageName;
  if (!http.begin(secureClient, imageUrl)) {
    Serial.println("无法初始化图片 HTTPS 请求");
    return false;
  }

  http.setTimeout(AppConfig::kHttpTimeoutMs);
  http.setConnectTimeout(AppConfig::kHttpConnectTimeoutMs);
  http.addHeader("Authorization", String("Bearer ") + accessToken_);
  http.addHeader("Accept", "image/png");

  Serial.print("正在请求图片: ");
  Serial.println(imageName);
  const int httpCode = http.GET();
  Serial.print("图片接口 HTTP 状态码: ");
  Serial.println(httpCode);

  if (!isSuccessfulHttpStatus(httpCode)) {
    if (httpCode < 0) {
      Serial.print("图片请求失败: ");
      Serial.println(http.errorToString(httpCode));
    } else {
      Serial.println("图片接口返回非成功状态码");
    }
    http.end();
    return false;
  }

  const int contentLength = http.getSize();
  if (contentLength > 0 &&
      static_cast<size_t>(contentLength) > AppConfig::kMaxImageSizeBytes) {
    Serial.println("图片超过 2 MB 安全限制，拒绝下载");
    http.end();
    return false;
  }
  const size_t initialCapacity =
      contentLength > 0 ? static_cast<size_t>(contentLength)
                        : AppConfig::kInitialImageCapacity;

  PsramImage downloadedImage;
  if (!downloadedImage.allocate(initialCapacity)) {
    Serial.print("PSRAM 分配失败，需要字节数: ");
    Serial.println(initialCapacity);
    http.end();
    return false;
  }

  PsramImageWriteStream imageStream(downloadedImage,
                                    AppConfig::kMaxImageSizeBytes);
  const int bytesWritten = http.writeToStream(&imageStream);
  http.end();

  if (bytesWritten <= 0) {
    Serial.print("图片数据接收失败: ");
    Serial.println(http.errorToString(bytesWritten));
    return false;
  }
  if (imageStream.bytesWritten() != static_cast<size_t>(bytesWritten)) {
    Serial.println("图片数据接收不完整或超过 2 MB 安全限制");
    return false;
  }
  if (contentLength > 0 && bytesWritten != contentLength) {
    Serial.println("图片实际接收长度与 Content-Length 不一致");
    return false;
  }

  downloadedImage.setSize(imageStream.bytesWritten());
  destination.swap(downloadedImage);

  Serial.print(imageName);
  Serial.print(" 已存入 PSRAM，大小: ");
  Serial.print(destination.size());
  Serial.println(" 字节");
  return true;
}

bool EpaperApiClient::downloadNews(const char *url, const char *responseKey,
                                   size_t maximumItemCount,
                                   bool includeDuration,
                                   NewsList &destination) {
  if (!networkRequestsAllowed()) return false;
  SecureClient secureClient;
  HTTPClient http;
  configureTls(secureClient);

  const String newsUrl =
      String(url) + "?page=1&page_size=" + String(maximumItemCount);
  if (!http.begin(secureClient, newsUrl)) {
    Serial.println("无法初始化新闻 HTTPS 请求");
    return false;
  }

  http.setTimeout(AppConfig::kHttpTimeoutMs);
  http.setConnectTimeout(AppConfig::kHttpConnectTimeoutMs);
  http.addHeader("Authorization", String("Bearer ") + accessToken_);
  http.addHeader("Accept", "application/json");

  Serial.println("正在请求新闻列表");
  const int httpCode = http.GET();
  Serial.print("新闻接口 HTTP 状态码: ");
  Serial.println(httpCode);
  if (!isSuccessfulHttpStatus(httpCode)) {
    if (httpCode < 0) {
      Serial.print("新闻请求失败: ");
      Serial.println(http.errorToString(httpCode));
    } else {
      Serial.println("新闻接口返回非成功状态码");
    }
    http.end();
    return false;
  }

  // HTTPClient handles chunk framing; the sink enforces the limit while reading.
  PsramImage responseBody;
  const bool responseOk =
      readBoundedResponse(http, responseBody, AppConfig::kMaxNewsResponseBytes);
  http.end();
  if (!responseOk) {
    return false;
  }

  // Only retain the text rendered by the e-paper news pages. Filtering image
  // URLs and other metadata keeps JSON memory usage small.
  JsonDocument responseFilter;
  responseFilter[responseKey][0]["title"] = true;
  responseFilter[responseKey][0]["summary"] = true;
  if (includeDuration) {
    responseFilter[responseKey][0]["duration"] = true;
  }
  JsonDocument responseJson;
  const DeserializationError jsonError =
      deserializeJson(responseJson,
                      static_cast<const uint8_t *>(responseBody.data()),
                      responseBody.size(),
                      DeserializationOption::Filter(responseFilter));
  if (jsonError) {
    Serial.print("新闻 JSON 解析失败: ");
    Serial.println(jsonError.c_str());
    return false;
  }

  const JsonArray newsJson = responseJson[responseKey].as<JsonArray>();
  if (newsJson.isNull()) {
    Serial.print("新闻响应中没有有效的 ");
    Serial.print(responseKey);
    Serial.println(" 数组");
    return false;
  }

  NewsList refreshedNews;
  for (JsonObject itemJson : newsJson) {
    if (refreshedNews.count >= maximumItemCount ||
        refreshedNews.count >= AppConfig::kNewsStorageCount) {
      break;
    }

    const char *title = itemJson["title"] | "";
    if (title[0] == '\0') {
      continue;
    }

    NewsItem &item = refreshedNews.items[refreshedNews.count++];
    item.title = title;
    item.summary = itemJson["summary"] | "";
    if (includeDuration) {
      item.duration = itemJson["duration"] | "";
    }
  }

  if (refreshedNews.count == 0) {
    Serial.println("新闻列表为空，继续保留旧数据");
    return false;
  }

  destination = std::move(refreshedNews);
  Serial.print("新闻列表已更新，共 ");
  Serial.print(destination.count);
  Serial.println(" 条");
  return true;
}
